Tekla.Structures.Drawing.PlacingAttributes
The PlacingAttributes class contains the basic attributes for determining an object's placing.
The following example enumerates through all marks in all views and changes
their PlacingAttributes and InsertionPoints.
You may try commenting out either Modify part to see how it affects the end result.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
MarkBase MyMarkBase;
DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
while(views.MoveNext())
{
DrawingObjectEnumerator allObjects = (views.Current as ViewBase).GetAllObjects();
while(allObjects.MoveNext())
{
if(allObjects.Current is MarkBase)
{
MyMarkBase = allObjects.Current as MarkBase;
// Using PlacingAttributes.IsFixed = true will force the mark to go to the specified point.
MyMarkBase.Attributes.PlacingAttributes.IsFixed = true;
MyMarkBase.InsertionPoint = new Point(100, 100);
MyMarkBase.Modify();
// Using PlacingAttributes.IsFixed = false will try to place the mark to the specified point,
// however, if there's already an object there, it will find a new place around that area.
// When finding a place around the area, the rest of the PlacingAttributes take effect.
MyMarkBase.Attributes.PlacingAttributes.IsFixed = false;
// Minimum distance from other objects when searching for a space to place the mark
MyMarkBase.Attributes.PlacingAttributes.PlacingDistance.SearchMargin = 10.0;
// Minimum distance from the drawing object
MyMarkBase.Attributes.PlacingAttributes.PlacingDistance.MinimalDistance = 1.0;
// Maximum distance from the drawing object (0.0 = no limit)
MyMarkBase.Attributes.PlacingAttributes.PlacingDistance.MaximalDistance = 0.0;
// The directions to look for possible places
MyMarkBase.Attributes.PlacingAttributes.PlacingQuarter = new PlacingQuarterAttributes(TopLeft: true, TopRight: true, BottomLeft: true, BottomRight: true);
MyMarkBase.InsertionPoint = new Point(100, 100);
MyMarkBase.Modify();
}
}
}
}
}
}

Tekla.Structures.Drawing.PlacingAttributes.IsFixed
Defines whether the object is using fixed or free placing.
If set to true, it means that fixed placing is enabled, and the object will not be rearranged
in the drawing automatically.
If set to false, then free placing is enabled, and the object will be placed in the most
appropriate location near the original location.

Tekla.Structures.Drawing.PlacingAttributes.PlacingDistance
Gets or sets the placing distance attributes.

Tekla.Structures.Drawing.PlacingAttributes.PlacingQuarter
Gets or sets the placing quarter attributes.

Tekla.Structures.Drawing.PlacingAttributes.#ctor
Creates a new placing attributes instance. The default parameters are:
IsFixed = true, default PlacingDistanceAttributes, default PlacingQuarterAttributes.

Tekla.Structures.Drawing.PlacingAttributes.#ctor(System.Boolean,Tekla.Structures.Drawing.PlacingDistanceAttributes,Tekla.Structures.Drawing.PlacingQuarterAttributes)
Creates a new placing quarter attributes instance with the given parameters.
IsFixed: Defines whether the object is using fixed or free placing.
PlacingDistance: The distances to be used for the placing.
PlacingQuarter: The directions in which the placing can find suitable locations.

Tekla.Structures.Drawing.PlacingAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PlacingAttributes.Clone
Creates a new object that is a copy of the current instance.
Returns:
A new object that is a copy of the current instance.
2